<?php

use App\Models\Department;
use App\Models\Events\EventCategory;
use App\Models\Events\EventRelation;
use App\Models\Events\EventType;
use Illuminate\Database\Seeder;

/**
 * Класс, представляющий сидер справочников приложения.
 */
class DictionariesSeeder extends Seeder
{
    /**
     * Запускает заполнение базы данных.
     *
     * @return void
     */
    public function run()
    {
        // Отделы
        $departments = [
            "Летный комплекс",
            "Технический комплекс",
            "Центр управления полетами",
            "Производственно-диспетчерская служба",
            "Служба бортпроводников",
            "Служба организации перевозок",
            "Служба авиационной безопасности",
            "Инспекция по безопасности полетов",
            "Отдел качества",
            "Комплекс сервиса",
            "Командно-руководящий состав",
            "Служба информационных технологий",
            "Медицинская служба",
            "Группа организации наземного обслуживания",
            "Служба организационного обеспечения полетов"
        ];
        // Мероприятия, к которым относятся события
        $relations = [
            "Операционная деятельность",
            "Аудиты качества",
            "Инспекторские проверки",
            "Проверки Росавиации",
            "Проверки Ространснадзора",
            "Инспекции SAFA",
            "Расследования авиационных событий",
            "Служебные расследования"
        ];
        // Типы событий
        $types = [
            "Усложнение условий полета",
            "Сложная ситуация",
            "Аварийная ситуация",
            "Катастрофическая ситуация"
        ];
        // Категории событий
        $categories = [
            'Летный комплекс' => [
                ['code' => "ЛК1", 'name' => "Инциденты по вине летного состава"],
                ['code' => "ЛК2", 'name' => "Нарушение технологии работы экипажа"],
                ['code' => "ЛК3", 'name' => "Отклонения в технике пилотирования"],
                ['code' => "ЛК4", 'name' => "Замечания от экипажа по работе систем ВС"],
            ],
            'Технический комплекс' => [
                ['code' => "21", 'name' => "Air Conditioning"],
                ['code' => "22", 'name' => "Auto Flight"],
                ['code' => "23", 'name' => "Communication"],
                ['code' => "24", 'name' => "Electrical Power"],
                ['code' => "25", 'name' => "Equipment & Furnish"],
                ['code' => "26", 'name' => "Fire Protection"],
                ['code' => "27", 'name' => "Flight Control"],
                ['code' => "28", 'name' => "Fuel"],
                ['code' => "29", 'name' => "Hidraulic Power"],
                ['code' => "30", 'name' => "Ice & Rain Protection"],
                ['code' => "31", 'name' => "Indicating/Recording"],
                ['code' => "32", 'name' => "Landing Gear"],
                ['code' => "33", 'name' => "Lights"],
                ['code' => "34", 'name' => "Navigation"],
                ['code' => "35", 'name' => "Oxygen"],
                ['code' => "36", 'name' => "Pneumatic"],
                ['code' => "38", 'name' => "Water & Waste"],
                ['code' => "44", 'name' => "Cabin systems"],
                ['code' => "49", 'name' => "APU"],
                ['code' => "51", 'name' => "Structure General"],
                ['code' => "52", 'name' => "Doors"],
                ['code' => "53", 'name' => "Fuselage"],
                ['code' => "54", 'name' => "Nacelles & Pylon"],
                ['code' => "55", 'name' => "Stabilizer"],
                ['code' => "56", 'name' => "Windows"],
                ['code' => "57", 'name' => "Wing"],
                ['code' => "71", 'name' => "Power Plant General"],
                ['code' => "72", 'name' => "Engine General"],
                ['code' => "73", 'name' => "Engine Fuel"],
                ['code' => "74", 'name' => "Ignition"],
                ['code' => "75", 'name' => "Engine Air"],
                ['code' => "76", 'name' => "Engine Control"],
                ['code' => "77", 'name' => "Engine Indicating"],
                ['code' => "78", 'name' => "Reversers"],
                ['code' => "79", 'name' => "Engine Oil"],
                ['code' => "80", 'name' => "Engine Start"],
                ['code' => "Общие", 'name' => "Несоответствия, не подходящие ни под одну категорию"]
            ],
            'Центр управления полетами' => [
                ['code' => "АОП 01", 'name' => "Деятельность аэропорта вылета"],
                ['code' => "АОП 02", 'name' => "Сервисное обеспечение рейса"],
                ['code' => "АОП 03", 'name' => "Обеспечение ГСМ"],
                ['code' => "АОП 04", 'name' => "Техническое обслуживание"],
                ['code' => "АОП 05", 'name' => "Подготовка экипажа к вылету"],
                ['code' => "АОП 06", 'name' => "Слив топлива"],
                ['code' => "АОП 07", 'name' => "Погодные и/или геофизические условия"],
                ['code' => "АОП 08", 'name' => "Функционирование средств связи"],
                ['code' => "АОП 09", 'name' => "Позднее прибытие ВС в аэропорт назначения"],
                ['code' => "АОП 10", 'name' => "Деятельность Евроконтроля"],
                ['code' => "АОП 11", 'name' => "Обеспечение резерва ВС/стыковки рейса"],
                ['code' => "АОП 12", 'name' => "Человеческий фактор"],
                ['code' => "АОП 13", 'name' => "Прочее"]
            ],
            'Производственно-диспетчерская служба' => [
                ['code' => "PDS 01", 'name' => "Деятельность аэропорта вылета"],
                ['code' => "PDS 02", 'name' => "Сервисное обеспечение рейса"],
                ['code' => "PDS 03", 'name' => "Обеспечение ГСМ"],
                ['code' => "PDS 04", 'name' => "Техническое обслуживание"],
                ['code' => "PDS 05", 'name' => "Подготовка экипажа к вылету"],
                ['code' => "PDS 06", 'name' => "Слив топлива"],
                ['code' => "PDS 07", 'name' => "Погодные и/или геофизические условия"],
                ['code' => "PDS 08", 'name' => "Функционирование средств связи"],
                ['code' => "PDS 09", 'name' => "Позднее прибытие ВС в аэропорт назначения"],
                ['code' => "PDS 10", 'name' => "Деятельность Евроконтроля"],
                ['code' => "PDS 11", 'name' => "Обеспечение резерва ВС/стыковки рейса"],
                ['code' => "PDS 12", 'name' => "Человеческий фактор"],
                ['code' => "PDS 13", 'name' => "Прочее"]
            ],
            'Служба бортпроводников' => [
                ['code' => "CAB 01", 'name' => "Взаимодействие с летным экипажем"],
                ['code' => "CAB 02", 'name' => "Эксплуатация оборудования салона и кухни"],
                ['code' => "CAB 03", 'name' => "Использование аварийно-спасательного оборудования (АСО) самолета"],
                ['code' => "CAB 04", 'name' => "Технология обслуживания пассажиров на борту"],
                ['code' => "CAB 05", 'name' => "Предполетная подготовка кабинного экипажа"]
            ],
            'Служба организации перевозок' => [
                ['code' => "GRH01", 'name' => "Несоответствия, связанные с регистрацией пассажиров и размещением на ВС"],
                ['code' => "GRH02", 'name' => "Загрузка и перевозка грузов"],
                ['code' => "GRH03", 'name' => "Загрузка и перевозка багажа"],
                ['code' => "GRH04", 'name' => "Использование специального оборудования"]
            ],
            'Инспекция по безопасности полетов' => [
                ['code' => "ИБП1", 'name' => "Авиационные инциденты и события"],
                ['code' => "ИБП2", 'name' => "ПВС"],
                ['code' => "ИБП3", 'name' => "Проверки государственными структурами"],
                ['code' => "ИБП4", 'name' => "Проверки SAFA"],
                ['code' => "ИБП5", 'name' => "Кабина экипажа (B)"],
                ['code' => "ИБП6", 'name' => "Безопасность. Пассажирский салон (B)"],
                ['code' => "ИБП7", 'name' => "Состояние ВС (С)"],
                ['code' => "ИБП8", 'name' => "Общие (E)"],
                ['code' => "ИБП9", 'name' => "Факторы опасности и управление рисками"],
                ['code' => "ИБП10", 'name' => "Прочие отклонения"]
            ],
            'Отдел качества' => [
                ['code' => "01", 'name' => "Результаты внутренних аудитов (несоответствия, влияющие на безопасность полетов)"],
                ['code' => "02", 'name' => "Результаты внешних аудитов (несоответствия, влияющие на безопасность полетов)"],
            ],
            'Служба организационного обеспечения полетов' => [
                ['code' => "СООП 01", 'name' => "Деятельность аэропорта вылета"],
                ['code' => "СООП 02", 'name' => "Сервисное обеспечение рейса"],
                ['code' => "СООП 03", 'name' => "Обеспечение ГСМ"],
                ['code' => "СООП 04", 'name' => "Техническое обслуживание"],
                ['code' => "СООП 05", 'name' => "Подготовка экипажа к вылету"],
                ['code' => "СООП 06", 'name' => "Слив топлива"],
                ['code' => "СООП 07", 'name' => "Погодные и/или геофизические условия"],
                ['code' => "СООП 08", 'name' => "Функционирование средств связи"],
                ['code' => "СООП 09", 'name' => "Позднее прибытие ВС в аэропорт назначения"],
                ['code' => "СООП 10", 'name' => "Деятельность Евроконтроля"],
                ['code' => "СООП 11", 'name' => "Обеспечение резерва ВС/стыковки рейса"],
                ['code' => "СООП 12", 'name' => "Человеческий фактор"],
                ['code' => "СООП 13", 'name' => "Прочее"]
            ]
        ];
        // Перебираем отделы
        foreach ($departments as $department) {
            // Добавляем новый отдел
            $newDepartment = Department::firstOrCreate([
                'name' => $department
            ]);
            // Если для отдела есть категории событий
            if(array_key_exists($department, $categories)) {
                // Получаем их
                $departmentCategories = $categories[$department];
                // Добавляем категории событий для отдела
                foreach ($departmentCategories as $category) {
                    EventCategory::firstOrCreate(
                        ['code' => $category['code']],
                        ['name' => $category['name'], 'department_id' => $newDepartment->id]
                    );
                }
            }
        }
        // Перебираем мероприятия
        foreach ($relations as $relation) {
            // Добавляем новое мероприятие
            EventRelation::firstOrCreate([
                'name' => $relation
            ]);
        }
        // Перебираем типы событий
        foreach ($types as $type) {
            // Добавляем новый тип событий
            EventType::firstOrCreate([
                'name' => $type
            ]);
        }
    }
}
