@extends('layouts.app')

@section('title', 'Спасибо за сообщение!')

@section('content')
    <p>
        Ваше событие было успешно добавлено в базу данных. Обращаем Ваше внимание, что анонимные
        события сначала должны пройти проверку и быть одобрены к публикации. Соответствующее уведомление
        уже было отправлено ответственным сотрудникам.
    </p>
    <p>
        Если Вы работаете в нашей авиакомпании и хотите добавлять события на постоянной основе,
        Вам нужно получить логин и пароль к базе данных SMS. Для того чтобы это сделать, обратитесь к
        своему руководителю.
    </p>
    <p>
        Мы благодарим Вас за использование нашего сервиса и желаем приятного дня <i class="far fa-smile"></i>
    </p>
@endsection
