<?php

return [
    '401' => 'Для доступа к данному ресурсу необходимо авторизоваться.',
    '403' => 'Недостаточно прав на выполнение указанной операции.',
    '404' => 'Страница, которую вы запрашиваете, не существует.',
    '419' => 'Вы пытаетесь запросить страницу не указав необходимые данные.',
    '429' => 'Количество запросов превысило разрешённый порог.',
    '500' => 'Во время выполнения вашего запроса возникла ошибка.',
    '503' => 'Сервис временно недоступен',
    'maintenance' => 'Приложение на обслуживании'
];
